In [4]:
import pandas as pd
import numpy as np
import seaborn as sns

# 1번

In [2]:
for i in range(1,10):
    a = 9*i
    if a%2 == 0:
        print(a)

18
36
54
72

# 2번

In [49]:
iris =sns.load_dataset('iris')
iris.sample()

     sepal_length  sepal_width  petal_length  petal_width    species
111           6.4          2.7           5.3          1.9  virginica

## 2-(1)

In [6]:
iris['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

## 2-2

In [7]:
iris.groupby('species').max()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               5.8          4.4           1.9          0.6
versicolor           7.0          3.4           5.1          1.8
virginica            7.9          3.8           6.9          2.5

## 2-3

In [68]:
iris['species'] = iris['species'].apply(lambda x: 1 if x == 'setosa' else 0)

# 3번

In [23]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## 3-1

In [26]:
df = titanic[['pclass','age','sibsp','fare','class']]
df.head()

   pclass   age  sibsp     fare  class
0       3  22.0      1   7.2500  Third
1       1  38.0      1  71.2833  First
2       3  26.0      0   7.9250  Third
3       1  35.0      1  53.1000  First
4       3  35.0      0   8.0500  Third

## 3-2

In [30]:
df.isnull().sum()

pclass      0
age       177
sibsp       0
fare        0
class       0
dtype: int64

## 3-3

In [35]:
df['age'].fillna(df['age'].mean(),inplace =True)
df.head()

C:\Users\82109\anaconda3\lib\site-packages\pandas\core\generic.py:6392: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

   pclass   age  sibsp     fare  class
0       3  22.0      1   7.2500  Third
1       1  38.0      1  71.2833  First
2       3  26.0      0   7.9250  Third
3       1  35.0      1  53.1000  First
4       3  35.0      0   8.0500  Third

## 3-4

In [36]:
survived = pd.read_csv("C:/Users/82109/data_setting/data/survived.csv")
survived.head()

   survived
0         0
1         1
2         1
3         1
4         0

## 3-5

In [40]:
df2=pd.concat([df,survived],axis= 1)
df2.head()

   pclass   age  sibsp     fare  class  survived
0       3  22.0      1   7.2500  Third         0
1       1  38.0      1  71.2833  First         1
2       3  26.0      0   7.9250  Third         1
3       1  35.0      1  53.1000  First         1
4       3  35.0      0   8.0500  Third         0

In [47]:
df2.groupby('class')['survived'].mean()

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64